Material/Assignment-input-GANTT.tex
% Created 2019-11-06 Wed 11:31
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mikael Svahnberg}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={Mikael Svahnberg},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.2 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\tableofcontents


\section{Use Case \emph{Get Help}}
\label{sec:orgc9047be}
\subsection{Analysis}
\label{sec:org899eaf8}
\subsection{Design -- Help Framework}
\label{sec:orgee42cd0}
\subsection{Define Database Schema -- Help Framework}
\label{sec:orga76645d}
\subsection{Design -- Interface to Help Framework}
\label{sec:org9902801}
\subsection{Create Help Texts}
\label{sec:org78fdfc4}
\subsection{Create Unit Tests for Help Framework}
\label{sec:org0a155ee}
\subsection{Create Unit Tests for Help Interface}
\label{sec:org9068da0}
\subsection{Implementation Help Framework}
\label{sec:orgdca096e}
\subsection{Implementation Help Interface}
\label{sec:org027d5ae}
\subsection{Testing Help Framework}
\label{sec:orgc736370}
\subsection{Testing Help Interface}
\label{sec:orge945ba1}
\section{Use Case \emph{Set Checkpoint}}
\label{sec:orgf161bf9}
\subsection{Analysis}
\label{sec:org823b410}
\subsection{Analysis -- What is part of a Checkpoint?}
\label{sec:orga034cdf}
\subsection{Define Database Schema}
\label{sec:org8a0abc1}
\subsection{Design -- Extracting a Checkpoint}
\label{sec:org75c80ad}
\subsection{Design -- Writing Checkpoint to Database}
\label{sec:orgd3f5698}
\subsection{Create Unit Tests -- Writing a Checkpoint}
\label{sec:org1a8ea45}
\subsection{Create Unit Tests -- Extracting a Checkpoint}
\label{sec:orgcd62640}
\subsection{Implementation -- Writing a Checkpoint}
\label{sec:org475965e}
\subsection{Implementation -- Extracting a Checkpoint}
\label{sec:org31ef7c4}
\subsection{Testing -- Writing a Checkpoint}
\label{sec:orgb5655dc}
\subsection{Testing -- Extracting a Checkpoint}
\label{sec:org4863f33}
\section{Use Case \emph{List Checkpoints}}
\label{sec:orge315841}
\subsection{Analysis}
\label{sec:org7f0ea37}
\subsection{Design}
\label{sec:org324bd04}
\subsection{Create Unit Tests}
\label{sec:org167eabb}
\subsection{Implementation}
\label{sec:org652d3f9}
\subsection{Testing}
\label{sec:org289ce52}
\section{Use Case \emph{Enhanced Enter Scene}}
\label{sec:org1d7a451}
\subsection{Analysis}
\label{sec:org6d97e88}
\subsection{Design Location Framework}
\label{sec:org8c0e827}
\subsection{Design Scene Availability Framework}
\label{sec:orge9c735f}
\subsection{Design Scene Availability Notifications}
\label{sec:org20fb4d4}
\subsection{Design Event Framework}
\label{sec:org3e1eca0}
\subsection{Design -- Trigger Entry Events}
\label{sec:orge9cbebd}
\subsection{Create Unit Tests -- Location Framework}
\label{sec:orga7e4c7d}
\subsection{Create Unit Tests -- Scene Availability Frameworks}
\label{sec:org59a8e8b}
\subsection{Create Unit Tests -- Event Framework}
\label{sec:org9f6766b}
\subsection{Implementation -- Location Framework}
\label{sec:orgf6813aa}
\subsection{Implementation -- Scene Availability Frameworks}
\label{sec:orgc55acfd}
\subsection{Implementation -- Event Framework}
\label{sec:org8f90c26}
\subsection{Testing -- Location Framework}
\label{sec:org707561d}
\subsection{Testing -- Scene Availability Frameworks}
\label{sec:orgd91beea}
\subsection{Testing -- Event Framework}
\label{sec:orgacbe70b}
\section{Use Case \emph{Enhanced Interact with Object}}
\label{sec:orgc233c41}
\subsection{Analysis}
\label{sec:orgb9fa58d}
\subsection{Design -- Interaction Events}
\label{sec:org411a082}
\subsection{Design -- Persistent GameObject States}
\label{sec:org1f91e58}
\subsection{Define Database Schema}
\label{sec:org9f3e5c5}
\subsection{Create Unit Tests -- Interaction Events}
\label{sec:org46e1919}
\subsection{Create Unit Tests -- Persistent GameObject States}
\label{sec:orga33e4cd}
\subsection{Implementation -- Interaction Events}
\label{sec:orga552d76}
\subsection{Implementation -- Persistent GameObject States}
\label{sec:org4b1b210}
\subsection{Testing -- Interaction Events}
\label{sec:org6174bc1}
\subsection{Testing -- Persistent GameObject States}
\label{sec:orgfabaa6a}
\section{Use Case \emph{Enhanced Interact with Character}}
\label{sec:orgf8fca36}
\subsection{Analysis}
\label{sec:orgf8bfb57}
\subsection{Design -- Interaction Events}
\label{sec:orgaac5fff}
\subsection{Design -- Persistent Character States}
\label{sec:org9e83e7f}
\subsection{Define Database Schema}
\label{sec:org4aeea45}
\subsection{Create Unit Tests -- Interaction Events}
\label{sec:orgda8b048}
\subsection{Create Unit Tests -- Persistent Character States}
\label{sec:org17b9fe0}
\subsection{Implementation -- Interaction Events}
\label{sec:orgeb0e894}
\subsection{Implementation -- Persistent Character States}
\label{sec:orgb8f1c00}
\subsection{Testing -- Interaction Events}
\label{sec:org47c0bf3}
\subsection{Testing -- Persistent Character States}
\label{sec:org96b9086}
\end{document}